app/views/users/show.html.erb

<ul>
  <% @user.goals.each do |goal| %>
---
SELECT `goals`.* FROM `goals` WHERE (`goals`.user_id = 1)

    <% fin = goal.finished %>
     <% goal.carrots.each do |carrot| %>
---
SELECT `carrots`.* FROM `carrots` WHERE (`carrots`.goal_id = 64)