app/controllers/attached_files_controller.rb

  def index
    @attached_files = AttachedFile.all
---
SELECT `attached_files`.* FROM `attached_files`

  def show
    @attached_file = AttachedFile.find(params[:id])
---
SELECT `attached_files`.* FROM `attached_files` WHERE `attached_files`.`id` = 1 LIMIT 1

  def create
    @attached_file = AttachedFile.new(params[:attached_file])

    respond_to do |format|
      if @attached_file.save
---
INSERT INTO `attached_files` (`created_at`, `user_id`, `file_file_name`, `file_updated_at`, `file_file_size`, `updated_at`, `file_content_type`) VALUES ('2011-06-25 07:23:32', 1, 'BenHall-Resume.pdf', '2011-06-25 07:23:28', 247933, '2011-06-25 07:23:32', 'application/pdf')