app/controllers/carrots_controller.rb

SELECT `carrots`.* FROM `carrots` WHERE `carrots`.`id` = 5 LIMIT 1
SELECT `goals`.* FROM `goals` WHERE `goals`.`id` = 68 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def index
    @carrots = Carrot.find(:all, :include => :goal, :conditions => ['goals.user_id = (?)', current_user.id])

SELECT `carrots`.* FROM `carrots` WHERE `carrots`.`id` = 1 LIMIT 1
---
  def show
    @carrot = Carrot.find(params[:id])

INSERT INTO `carrots` (`media_file_name`, `goal_id`, `updated_at`, `friend_id`, `media_updated_at`, `media_content_type`, `media_file_size`, `title`, `created_at`) VALUES ('IMG_0293.JPG', 68, '2011-06-26 01:01:35', 3, '2011-06-26 01:01:33', 'image/jpeg', 1137768, 'baylee couch', '2011-06-26 01:01:35')
---
  def create
    @carrot = Carrot.new(params[:carrot])

    respond_to do |format|
      if @carrot.save