app/controllers/carrots_controller.rb

  def index
    @carrots = Carrot.all
---
SELECT `carrots`.* FROM `carrots` LIMIT 1