app/controllers/emergency_contacts_controller.rb

  def index
    @emergency_contacts = EmergencyContact.all
---
SELECT `emergency_contacts`.* FROM `emergency_contacts`

  def show
    @emergency_contact = EmergencyContact.find(params[:id])
---
SELECT `emergency_contacts`.* FROM `emergency_contacts` WHERE `emergency_contacts`.`id` = 1 LIMIT 1

  def create
    @emergency_contact = EmergencyContact.new(params[:emergency_contact])

    respond_to do |format|
      if @emergency_contact.save
---
INSERT INTO `emergency_contacts` (`created_at`, `phone`, `user_id`, `address`, `relationship`, `first_name`, `last_name`, `email`, `updated_at`) VALUES ('2011-06-25 06:20:08', '888', NULL, '123', '123', 'Ben', 'Hall', 'benhall2121@yahoo.com', '2011-06-25 06:20:08')