app/controllers/friendships_controller.rb

INSERT INTO `friendships` (`user_id`, `updated_at`, `friend_id`, `created_at`) VALUES (3, '2011-06-25 22:21:42', 2, '2011-06-25 22:21:42')
---
  def create
    @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
    if @friendship.save