app/controllers/goals_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def index
    @goals = Goal.find(:all, :conditions => ['goals.user_id = (?)', current_user.id])