app/controllers/goals_controller.rb

  def index
    @goals = Goal.all
---
SELECT `goals`.* FROM `goals` WHERE (goals.user_id = (6))

  def show
    @goal = Goal.find(params[:id])
---
SELECT `goals`.* FROM `goals` WHERE `goals`.`id` = 1 LIMIT 1

  def create
    @goal = Goal.new(params[:goal])

    respond_to do |format|
      if @goal.save

      	user_name = @goal.user.first_name + ' ' + @goal.user.last_name
---
INSERT INTO `goals` (`user_id`, `deadline`, `created_at`, `friend_id`, `message`, `finished`, `title`, `updated_at`) VALUES (11, '2011-06-26 00:00:00', '2011-06-26 21:27:52', NULL, 'asd', NULL, 'another new goal', '2011-06-26 21:27:52')
SELECT `users`.* FROM `users` INNER JOIN `friendships` ON `users`.id = `friendships`.user_id WHERE ((`friendships`.friend_id = 3))

  def destroy
    @goal = Goal.find(params[:id])
    @goal.destroy
---
SELECT `goals`.* FROM `goals` WHERE `goals`.`id` = 8 LIMIT 1
DELETE FROM `goals` WHERE `goals`.`id` = 8