app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`phone`, `photo_file_name`, `first_name`, `password_hash`, `updated_at`, `photo_updated_at`, `photo_content_type`, `photo_file_size`, `password_salt`, `created_at`, `email`, `last_name`) VALUES (NULL, 'IMG_0067.JPG', NULL, '$2a$10$TzqCAlNZCVJrt2qNy6PCIeO4fpsptSeHKu0APcWZDj2EicGEZZclu', '2011-06-26 22:06:26', '2011-06-26 22:06:23', 'image/jpeg', 1235770, '$2a$10$TzqCAlNZCVJrt2qNy6PCIe', '2011-06-26 22:06:26', '1234', NULL)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `password_salt` = '$2a$10$LC2lZI7eeQNe9qFldCAsZe', `password_hash` = '$2a$10$LC2lZI7eeQNe9qFldCAsZeLwgeDpkdWQKjOc0PvFpfRGT141X.O7O', `phone` = '4804148157', `updated_at` = '2011-06-26 22:26:09' WHERE `users`.`id` = 1