app/views/goals/index.html.erb

SELECT `carrots`.* FROM `carrots` WHERE (`carrots`.goal_id = 64)
---
    <% fin = goal.finished %>
     <% goal.carrots.each do |carrot| %>