app/views/goals/show.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  <b>User:</b>
  <%= @goal.user.first_name %>